
gap_bot_token=''
IDReport='@'


timeformat='%Y:%m:%d %H:%M'
jalaliFormat="%a%d%b %Y  %H:%M"

emptyEmoji="‍" #it's not blank.it's hidden emoji. you can search on net!

#when user send schedule msg.in keyborad msg with time appear and 
#if user click on it content of that msg show then user can deside 
#to remove msg or not .and this is secret value to understand user want to see thier msg
msgContent=emptyEmoji+"row"

#keyBoard
'''formTimeSend=[ #put it in main source code
    {"name": "hours", "type": "text", "label": "ساعت"},
    {"name": "mintues", "type": "text", "label": "دقیقه"},
    {"type": "submit", "label": "ok"}
]'''
formSetting=[
    {"name": "chanNel", "type": "text", "label": "ایدی کانال بدون @"},
    {"name": "TokEn", "type": "text", "label": "توکن را وارد کنید"},
    {"type": "submit", "label": "ارسال"}
]
formNewID=[
    {"name": "chanNel", "type": "text", "label": "ایدی کانال بدون @"},
    {"type": "submit", "label": "ارسال"}
]
backKeyboard={
        "keyboard": [
            [
                {"برگشت": "برگشت"}
            ]
        ],
}
settingKeyboard={
        "keyboard": [
            [{"تغییر توکن": "تغییر توکن"}],
            [{"افزودن ایدی":"افزودن ایدی (کانال/گروه) جدید"}],
            [{"حذف ایدی":"حذف ایدی"}],
            [{"برگشت": "برگشت"}]
        ],
}
# use for select when user want to send msg
listDays=[{"0":"امروز"},
        {"1":"فردا"},
        {"2":"2"},
        {"3":"3"},
        {"4":"4"},
        {"5":"5"},
        {"6":"6"},
        {"7":"7"},
]
#delMsgKeyboard=  in the bot.py

#because of changable mainKeyboard i wrote this section on fullKeyBoard() in bot.py
'''mainKeyborad={
        "keyboard": [
            [
                {"برگشت": "🔙برگشت"},
                {"پیام زمان‌دار": "پیام زمان‌دار⏲"}
            ],
            [
               {"پشتیبانی":"💬پشتیبانی"},
               {"تنظیمات":"تنظیمات⚙️"},
               {"حمایت":"⛽️حمایت"},
               {"راهنما":"راهنما❕"}
            ]
        ],
}'''

#special caption for send to user 
backKeyCaption = 'عملیات لغو شد'
unknownStatus='ورودی نامعتبر'
newMsgcaption='''
زمان ارسال پست را وارد کنید (اعداد انگلیسی وارد کنید)
-دقت کنید که ساعت عددی بین 0 تا 23 باید باشد و دقیقه باید بین 0 تا 59 باشد!
-به جای ساعت 24:00 از  00:00 استفاده کنید.
-همچنین ربات از ساعت 03:00 تا 09:30 صبح پاسخگو نخواهد بود و هیچ پیامی رو هم ارسال نخواد کرد! و هرپیامی که در این بازه براش تعریف کنید رو در ساعت 09:30 ارسال خواهد کرد! 
 (چرا؟ جواب -> https://gap.im/timepost/3 )
'''

errorTime='زمانی که وارد کردید اشتباه هستش!!!!!!\n\n\n'
GuidCaption='''
این ربات توانایی ارسال پست زماندار به کانال و گروه هایی که ادمین(مدیر) آن هستید را دارد.

👇👇👇👇برای راه اندازی این ربات و گرفتن توکن به لینک زیر مراجعه بفرمایید👇👇👇👇
https://gap.im/timepost/4

👆👆👆👆اگر توکن نداری ، بزن روی لینک بالایییییییییییی ☝☝☝☝☝☝☝☝☝☝

📢کانال اطلاع‌رسانی ربات پیام زماندار:
@timepost

👮‍♀️ پشتیبانی : (سوال داری از من بپرس)
@mahdiAI313
'''

donateCaption='''
ممنون میشیم که از ما حمایت کنی . [بزن روی لینک]
https://pay.gap.im/mahdiAI313
اگر برنامه نویس هستید یا سرور یا هاست دارید و میتونید به ما کمک کنید،به پشتیبانی پیام بدید🙏
'''
supportCaption='انتقادات و پیشنهادات و همچینین مشکلات شما را پذیراییم @mahdiAI313'

incorrectFormCaption='''
توکن یا ایدی کانال شما اشتباه میباشد!

👇👇👇👇این اموزش رو نگاه کنید👇👇👇👇
https://gap.im/timepost/4
👆👆👆👆اگر توکن نداری ، بزن روی لینک بالایییییییییییی ☝☝☝☝☝☝☝☝☝☝

-دقت کنید که ایدی کانالتون رو باید بدون @ وارد کنید 
-از وارد کردن فاصله(space) بپرهیزید.
-از حروف کوچک استفاده کنید
-در صورت عدم رفع این مشکل به پشتیبانی پیام دهید. (@mahdiAI313)
'''
wellcomeCaption='''
خوش آمدید! ربات برای شما فعال شد!

خوش حال میشیم که در کانال های زیر هم عضو شوید
@aimachinelearning

@AI_event
'''
readytogetmsg='''
هر تعداد پیامی که میخواین در این زمان و کانال منتشر بشه رو بفرستید و در اخر دکمه 👈<b>برگشت</b>👉 رو بزنید.

اگر پیامی در زمان دیگر میخواستین ارسال کنید ، فقط لازمه روی گزینه پیام زمانبندی شده بزنید تا برای یک زمان جدید ربات تنظیم بشه.
'''
settingcaption='''
اگر میخوای ربات رو برای یک توکن جدید یا کانال و گروه جدید تنظیم کنی این فرم رو پر کن وگرنه برگشت رو بزن

اگر برای کانال جدید میخوای فعال کنی :
همون توکن قبلیتون رو هم میتونید وارد کنید

 دقت کنید که با تغییر توکن یا ایدی کانال ، اگر پستی 
از قبل زمان براش تعیین کردین ، طبق همون زمان به  ایدی کانال فعلیتون پست ارسال میشود!
و تغییرات جدید روی پست هایی که از الان به بعد تعیین زمان براشون کنید اعمال خواهد شد.
'''
changeToken='''
⚠️اگر میخوای توکن رو تغییر بدی این فرم رو پر کن! وگرنه برگشت بزن!

توکن جدید خودتو وارد فرم کن. 
ایدی یکی از کانال یا گروهایی که میخوای پیام زماندار براش بفرستی  رو  وارد کن.(ایدی همون کانال یا گروههای قبلیتو هم میتونی وارد کنی)

⚠️دقت کن که :
یک پیام حاوی یک نقطه توی اون کانال یا گروه ارسال میشه که میتونی پاک کنی. اینکارو میکنیم چون مطمین بشیم که توکن شما درست باشه
'''
updateSettingCap='با موفقیت تنظیم شد'

capScheduletimePost="\n\n⏰ زمان ارسال  "
textKeyRemove="پاک کن❌"

msgRemove="این پیام با موفقیت پاک شد"

addNewID='''
⚠️اگر میخوای ایدی کانال یا گروه جدیدی رو  اصافه کنی این فرم رو پر کن! وگرنه برگشت بزن!
 ایدی رو بدون @ وارد کنید!!!!!!!!!!!!!!!!
⚠️دقت کن که :
یک پیام حاوی یک نقطه توی اون کانال یا گروه ارسال میشه که میتونی پاک کنی. اینکارو میکنیم چون مطمین بشیم که ایدی شما درست باشه
'''
incorrectNewID='''
ایدی کانال یا گروهی که وارد کردی اشتباهه!

-بدون @ باید وارد کنی.
-از وارد کردن فاصله(space) بپرهیزید.
-در صورت عدم رفع این مشکل به پشتیبانی پیام دهید. (@mahdiAI313)
'''

removeID='''
اگر ایدی (کانال/گروه) رو میخوای پاک کنی  ، اون ایدی رو انتخاب و ارسال رو بزن     وگرنه برگشت رو بزن!!!

🚨حتما یک ایدی باید حداقل توی لیست بمونه ! پس اگر ایدیتو تغییر دادی ، اول اون ایدی جدید رو اضافه کن  ، بعد بیا اینجا و ایدی قدیمتو پاک کن!
'''

cantRemoveID="حداقل یک ایدی باید توی لیست باشه!! ایدی جدیدتو اول اضافه کن بعد بیا این قدیمیه رو پاک کن!"